; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-36)
(:domain gripper-strips)
(:objects rooma roomb room3 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 ball32 ball33 ball34 ball35 ball36 )
(:init
(room rooma)
(room roomb)
(room room3)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(ball ball31)
(ball ball32)
(ball ball33)
(ball ball34)
(ball ball35)
(ball ball36)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 rooma)
(at ball14 rooma)
(at ball15 rooma)
(at ball16 rooma)
(at ball17 rooma)
(at ball18 rooma)
(at ball19 rooma)
(at ball20 rooma)
(at ball21 rooma)
(at ball22 rooma)
(at ball23 rooma)
(at ball24 rooma)
(at ball25 rooma)
(at ball26 rooma)
(at ball27 rooma)
(at ball28 rooma)
(at ball29 rooma)
(at ball30 rooma)
(at ball31 rooma)
(at ball32 rooma)
(at ball33 rooma)
(at ball34 rooma)
(at ball35 rooma)
(at ball36 rooma)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 rooma)
(at ball14 rooma)
(at ball15 roomb)
(at ball16 roomb)
(at ball17 roomb)
(at ball18 roomb)
(at ball19 roomb)
(at ball20 roomb)
(at ball21 roomb)
(at ball22 roomb)
(at ball23 roomb)
(at ball24 roomb)
(at ball25 roomb)
(at ball26 roomb)
(at ball27 room3)
(at ball28 room3)
(at ball29 room3)
(at ball30 room3)
(at ball31 room3)
(at ball32 room3)
(at ball33 room3)
(at ball34 room3)
(at ball35 room3)
(at ball36 room3)
)
)
)

; plan
1. (pick ball36 rooma left)
   deleted: (at ball36 rooma) (free left)
   added: (carry ball36 left)
   goals met: 14 of 36
2. (pick ball35 rooma right)
   deleted: (at ball35 rooma) (free right)
   added: (carry ball35 right)
   goals met: 14 of 36
3. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 14 of 36
4. (drop ball35 room3 right)
   deleted: (carry ball35 right)
   added: (at ball35 room3) (free right)
   goals met: 15 of 36
5. (drop ball36 room3 left)
   deleted: (carry ball36 left)
   added: (at ball36 room3) (free left)
   goals met: 16 of 36
6. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 16 of 36
7. (pick ball34 rooma left)
   deleted: (at ball34 rooma) (free left)
   added: (carry ball34 left)
   goals met: 16 of 36
8. (pick ball33 rooma right)
   deleted: (at ball33 rooma) (free right)
   added: (carry ball33 right)
   goals met: 16 of 36
9. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 16 of 36
10. (drop ball33 room3 right)
   deleted: (carry ball33 right)
   added: (at ball33 room3) (free right)
   goals met: 17 of 36
11. (drop ball34 room3 left)
   deleted: (carry ball34 left)
   added: (at ball34 room3) (free left)
   goals met: 18 of 36
12. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 18 of 36
13. (pick ball32 rooma left)
   deleted: (at ball32 rooma) (free left)
   added: (carry ball32 left)
   goals met: 18 of 36
14. (pick ball31 rooma right)
   deleted: (at ball31 rooma) (free right)
   added: (carry ball31 right)
   goals met: 18 of 36
15. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 18 of 36
16. (drop ball31 room3 right)
   deleted: (carry ball31 right)
   added: (at ball31 room3) (free right)
   goals met: 19 of 36
17. (drop ball32 room3 left)
   deleted: (carry ball32 left)
   added: (at ball32 room3) (free left)
   goals met: 20 of 36
18. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 20 of 36
19. (pick ball30 rooma left)
   deleted: (at ball30 rooma) (free left)
   added: (carry ball30 left)
   goals met: 20 of 36
20. (pick ball29 rooma right)
   deleted: (at ball29 rooma) (free right)
   added: (carry ball29 right)
   goals met: 20 of 36
21. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 20 of 36
22. (drop ball29 room3 right)
   deleted: (carry ball29 right)
   added: (at ball29 room3) (free right)
   goals met: 21 of 36
23. (drop ball30 room3 left)
   deleted: (carry ball30 left)
   added: (at ball30 room3) (free left)
   goals met: 22 of 36
24. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 22 of 36
25. (pick ball28 rooma left)
   deleted: (at ball28 rooma) (free left)
   added: (carry ball28 left)
   goals met: 22 of 36
26. (pick ball27 rooma right)
   deleted: (at ball27 rooma) (free right)
   added: (carry ball27 right)
   goals met: 22 of 36
27. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 22 of 36
28. (drop ball27 room3 right)
   deleted: (carry ball27 right)
   added: (at ball27 room3) (free right)
   goals met: 23 of 36
29. (drop ball28 room3 left)
   deleted: (carry ball28 left)
   added: (at ball28 room3) (free left)
   goals met: 24 of 36
30. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 24 of 36
31. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 24 of 36
32. (pick ball26 rooma left)
   deleted: (at ball26 rooma) (free left)
   added: (carry ball26 left)
   goals met: 24 of 36
33. (pick ball25 rooma right)
   deleted: (at ball25 rooma) (free right)
   added: (carry ball25 right)
   goals met: 24 of 36
34. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 24 of 36
35. (drop ball25 roomb right)
   deleted: (carry ball25 right)
   added: (at ball25 roomb) (free right)
   goals met: 25 of 36
36. (drop ball26 roomb left)
   deleted: (carry ball26 left)
   added: (at ball26 roomb) (free left)
   goals met: 26 of 36
37. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 26 of 36
38. (pick ball24 rooma left)
   deleted: (at ball24 rooma) (free left)
   added: (carry ball24 left)
   goals met: 26 of 36
39. (pick ball23 rooma right)
   deleted: (at ball23 rooma) (free right)
   added: (carry ball23 right)
   goals met: 26 of 36
40. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 26 of 36
41. (drop ball23 roomb right)
   deleted: (carry ball23 right)
   added: (at ball23 roomb) (free right)
   goals met: 27 of 36
42. (drop ball24 roomb left)
   deleted: (carry ball24 left)
   added: (at ball24 roomb) (free left)
   goals met: 28 of 36
43. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 28 of 36
44. (pick ball22 rooma left)
   deleted: (at ball22 rooma) (free left)
   added: (carry ball22 left)
   goals met: 28 of 36
45. (pick ball21 rooma right)
   deleted: (at ball21 rooma) (free right)
   added: (carry ball21 right)
   goals met: 28 of 36
46. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 28 of 36
47. (drop ball21 roomb right)
   deleted: (carry ball21 right)
   added: (at ball21 roomb) (free right)
   goals met: 29 of 36
48. (drop ball22 roomb left)
   deleted: (carry ball22 left)
   added: (at ball22 roomb) (free left)
   goals met: 30 of 36
49. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 30 of 36
50. (pick ball20 rooma left)
   deleted: (at ball20 rooma) (free left)
   added: (carry ball20 left)
   goals met: 30 of 36
51. (pick ball19 rooma right)
   deleted: (at ball19 rooma) (free right)
   added: (carry ball19 right)
   goals met: 30 of 36
52. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 30 of 36
53. (drop ball19 roomb right)
   deleted: (carry ball19 right)
   added: (at ball19 roomb) (free right)
   goals met: 31 of 36
54. (drop ball20 roomb left)
   deleted: (carry ball20 left)
   added: (at ball20 roomb) (free left)
   goals met: 32 of 36
55. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 32 of 36
56. (pick ball18 rooma left)
   deleted: (at ball18 rooma) (free left)
   added: (carry ball18 left)
   goals met: 32 of 36
57. (pick ball17 rooma right)
   deleted: (at ball17 rooma) (free right)
   added: (carry ball17 right)
   goals met: 32 of 36
58. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 32 of 36
59. (drop ball17 roomb right)
   deleted: (carry ball17 right)
   added: (at ball17 roomb) (free right)
   goals met: 33 of 36
60. (drop ball18 roomb left)
   deleted: (carry ball18 left)
   added: (at ball18 roomb) (free left)
   goals met: 34 of 36
61. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 34 of 36
62. (pick ball16 rooma left)
   deleted: (at ball16 rooma) (free left)
   added: (carry ball16 left)
   goals met: 34 of 36
63. (pick ball15 rooma right)
   deleted: (at ball15 rooma) (free right)
   added: (carry ball15 right)
   goals met: 34 of 36
64. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 34 of 36
65. (drop ball16 roomb left)
   deleted: (carry ball16 left)
   added: (at ball16 roomb) (free left)
   goals met: 35 of 36
66. (drop ball15 roomb right)
   deleted: (carry ball15 right)
   added: (at ball15 roomb) (free right)
   goals met: 36 of 36
